# 4.7
#  Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
#  При вызове функции должен создаваться объект-генератор.
#  Функция должна вызываться следующим образом: for el in fact(n).
#  Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24
from itertools import count
from math import factorial


def get_fact(v_fact):
    for el in count(1):
        if el > v_fact:
            break
        yield factorial(el)


val = int(input("Задайте целое положительное число:"))
for i in get_fact(val):
    print(i)
